# St7GetSolverDefaultsInteger

Returns the value assigned to the integer solver defaults.

long St7GetSolverDefaultsInteger(long uID, long Parameter, long* Value)
Input Parameters
uID
Strand7 model file ID.
Parameter
Solver integer parameter; see Integer Parameters.
Output Parameters
Value
Integer value.